# -----------------------------------EMOJIS--------------------------------------------------
crossmark_emoji = "<:1_:725771516272181379>"
checkmark_emoji = "<:2_:725771516725297223>"
UnityEmoji = 735850638252048426
UnrealEmoji = 780024117637152769
BlenderEmoji = 780024507867987988
GodotEmoji = 780024321040449556
GamemakerEmoji = 780024651187355678
_3dEmoji = 780025103709765704
_2dEmoji = 780025147268530187
SoundEmoji = "🎵"
warningEmoji = "\U000026d4"
# -----------------------------------EMOJIS--------------------------------------------------


# ----------------------------------- COLORS--------------------------------------------------
default_color = 0x8658FF
exception_color = 0xFF3B6E
# ----------------------------------- COLORS--------------------------------------------------


# ----------------------------------- CHANNELS--------------------------------------------------
mod_Channel_id = 739171444864319545
welcome_channel_id = 674564988622340098
channels_channel_id = 675765066813014067
rules_channel_id = 676047368185184286
introduce_channel_id = 675750032909008947
NoXpchannels_id = [675750619784413184, 675750252082626589, 752578125644300449, 674577898409295872, 675769873338728448]
botchannel_id = 674577898409295872
private_channel_id = 674585230694154249
private2_channel_id = 676740206434451467
deletedmsgs_channel_id = 805363311914516481
allowed_paste_channelsid = [674585230694154249,675751482322321487,736310812787998732,773935539316326411,760140536199380993,675751520595214337]
# ----------------------------------- CHANNELS--------------------------------------------------


# -----------------------------------GUILD--------------------------------------------------
guild_id = 674564988056371206
# -----------------------------------GUILD--------------------------------------------------


# -----------------------------------ROLES--------------------------------------------------
muted_role_id = 772786908832727060
new_member_role_id = 731608244606337076
rewarded_roles = {5: 674578404841881640, 10: 674578841913655306, 20: 674579110130876427, 100: 674579236899520512}
moderator_role_name = "المشرفين"
moderator_role_id = 674574733269925889
users_giveable_roles_id = [778149036779110410, 778149110620487680, 778149289389850635, 778149416645165067,
                           778149492595621918, 778149528313528330, 778149561910427689, 778149668076519426]
# -----------------------------------ROLES--------------------------------------------------


goodwords = ['شكرا', 'يعطيك العافية', 'جزاك الله خير', 'جزاك الله خيرا','يعطيك العافيه']

rules = {1:"يمنع إستخدام الألفاظ النابية أو البذيئة أو التهجم على الأعضاء",
         2:"يمنع النقاش في الأمور السياسية أو الدينية أو أي موضوع ليس له علاقة بشكل مباشر بتطوير الألعاب وليس له قناة خاصة",
         3:"يمنع الإرسال المتكرر لنفس الرسالة في غير قناة السبام <#675750619784413184> ",
         4:" منافشة أي موضوع لا يمت للقناة بصلة عرضة للإنذار المباشر دون مراجعة",
         5:"يمنع تداول البرامج المقرصنة ( أو ملفات ال Crack ) ، أو الملفات التي تحتوي على فيروسات ",
         6:"طرح السؤال أو الإستفسار مباشرة من غير مقدمات مثل ( هل يمكنكم مساعدتي؟ )",
         7:"يمنع إرسال أي وسائط تحتوي على صور مخلة بالآداب",
         8:"ينبّه العضو 3 مرات لمخالفته القواعد قبل أن يتم حظره من المجموعة",
         9:"العضو الذي يخرج من السيرفر ثم يدخل مرة أخرى يفقد رتبته ونقاطه (xp)",
         10:"عند مشاركة لعبة او مشروع يجب أن يتم مشاركة رابط الVirusTotal مع رابط تحميل اللعبة وإلا سيتم حذف المشاركة",
         11:"يرجى محاولة الكتابة دائمًا باللغة العربية,ويمنع الكتابة بغير العربية و الإنجليزية",
         12:"يمنع العضو من إستخدامين حسابين نشيطين داخل السيرفر في نفس الوقت، وفي حال كان هناك حسابات قديمة يتم ذكرها للمشرفين ليتم حذفها",
         13:" أي شخص ينتحل عضوية شخص آخر أو يتهمه بتهم باطله، سيتم حظره مباشرة",
         14:"يمنع إرسال روابط لسيرفرات أخرى للأعضاء على الخاص، إذا تم التبليغ أكثر من مرة على نفس العضو يعطى إنذار",
         15:" السؤال والإستفسار والمجادلة لقرارات المشرفين عرضة للحصول على إنذار مباشر مثل السؤال عن سبب عقابه عضو آخر",
         16:" يمنع إستخدام أي صورة رمزية خادشة للحياء، كما يمنع إستخدام أسماء مخالفة لذلك، كل إسم أو صورة رمزية مخلة بالآداب أو تدعو للكراهية والعنصرية سيتم تنبيه صاحبها لتعديلها كحد أقصى 24 ساعة، فإذا لم يستجب سنضطر آسفين لحظره",
         77:"حاول ان تحب البطاطا!"}
